src/cf/Catalogs/ДелаХраненияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДелаХраненияДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДелоЗакрыто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияДел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураДел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТома</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМестоХранения</Name>
					<Comment>Последняя актуальная версия 1.4.3</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтноситсяКНоменклатуреДел</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураДел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВариантыФормДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВариантыФормДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бумажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электронная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БумажнаяИлиЭлектронная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/КатегорииДел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>КатегорииДел</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВременноеДо10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноеСвыше10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоянное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ПередачаДелВАрхив.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПередачаДелВАрхив</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДелХраненияДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Передал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение подготовившего</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сотрудник</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВыгрузкиВАрхив</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбменаСАрхивом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДелаХраненияДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДелоХраненияДокументов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/НоменклатураДел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НоменклатураДел</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидыДокументовЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВопросыДеятельностиЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияДела</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентыЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераСтатей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтметкаЭПК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛичномуСоставу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыНоменклатурыДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОперативногоХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВнутреннихДокументов</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыВходящихДокументов</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыИсходящихДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВопросыДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВопросДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ДелаХраненияДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("НоменклатураДел")
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Индекс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.НоменклатураДел, "Индекс");
	Представление = СокрЛП(Индекс) + " " + СокрЛП(Данные.Наименование);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Обложка дела
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Справочник.ДелаХраненияДокументов";
	КомандаПечати.Идентификатор = "Обложка";
	КомандаПечати.Представление = НСтр("ru = 'Обложка дела'");
	
	// Внутренняя опись
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Справочник.ДелаХраненияДокументов";
	КомандаПечати.Идентификатор = "ВнутренняяОпись";
	КомандаПечати.Представление = НСтр("ru = 'Внутренняя опись'");
	УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ФормаДокументов", Перечисления.ВариантыФормДокументов.Бумажная);
	
	// Реестр электронных документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Справочник.ДелаХраненияДокументов";
	КомандаПечати.Идентификатор = "РеестрЭД";
	КомандаПечати.Представление = НСтр("ru = 'Реестр ЭД'");
	УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ФормаДокументов", Перечисления.ВариантыФормДокументов.Электронная);
		
	// Карта-заместитель
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Справочник.ДелаХраненияДокументов";
	КомандаПечати.Идентификатор = "КартаЗаместитель";
	КомандаПечати.Представление = НСтр("ru = 'Карта-заместитель'");
		
	// Лист-заверитель
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Справочник.ДелаХраненияДокументов";
	КомандаПечати.Идентификатор = "ЛистЗаверитель";
	КомандаПечати.Представление = НСтр("ru = 'Лист-заверитель'");
		
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Обложка");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Обложка",
			НСтр("ru = 'Обложка дела'"),
			ПечатьОбложки(МассивОбъектов, ОбъектыПечати),
			,
			"Справочник.ДелаХраненияДокументов.ПФ_MXL_Обложка");
	КонецЕсли;
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВнутренняяОпись");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ВнутренняяОпись",
			НСтр("ru = 'Внутренняя опись'"),
			ПечатьВнутреннейОписи(МассивОбъектов, ОбъектыПечати),
			,
			"Справочник.ДелаХраненияДокументов.ПФ_MXL_ВнутренняяОпись");
	КонецЕсли;
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрЭД");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"РеестрЭД",
			НСтр("ru = 'Реестр электронных документов'"),
			ПечатьРеестраЭД(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
			,
			"Справочник.ДелаХраненияДокументов.ПФ_MXL_РеестрЭД");
	КонецЕсли;
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КартаЗаместитель");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"КартаЗаместитель",
			НСтр("ru = 'Карта-заместитель'"),
			ПечатьКартыЗаместителя(МассивОбъектов, ОбъектыПечати),
			,
			"Справочник.ДелаХраненияДокументов.ПФ_MXL_КартаЗаместитель");
	КонецЕсли;
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЛистЗаверитель");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ЛистЗаверитель",
			НСтр("ru = 'Лист-заверитель'"),
			ПечатьЛистаЗаверителя(МассивОбъектов, ОбъектыПечати),
			,
			"Справочник.ДелаХраненияДокументов.ПФ_MXL_ЛистЗаверитель");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьОбложки(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ОбложкаДела";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ДелаХраненияДокументов.ПФ_MXL_Обложка");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Дела.НомерТома КАК НомерТома,
	|	Дела.НоменклатураДел.Индекс КАК НомерДела,
	|	Дела.НоменклатураДел.ПолноеНаименование КАК ЗаголовокДела,
	|	Дела.НоменклатураДел.СрокХранения КАК СрокХранения,
	|	Дела.ДатаНачала КАК ДатаНачала,
	|	Дела.ДатаОкончания КАК ДатаОкончания,
	|	Дела.КоличествоЛистов КАК КоличествоЛистов,
	|	Дела.Организация КАК Организация,
	|	Дела.Подразделение
	|ИЗ
	|	Справочник.ДелаХраненияДокументов КАК Дела
	|ГДЕ
	|	Дела.Ссылка В(&Ссылки)";
	
	Запрос.УстановитьПараметр("Ссылки", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьОбложка = Макет.ПолучитьОбласть("Обложка");
	ТабДок.Очистить();

	ПервыйДокумент = Истина;
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ЗаголовокДела1 = "";
		ЗаголовокДела2 = "";
		ЗаголовокДела3 = "";
		ЗаголовокДела4 = "";
		ЗаголовокДела5 = "";
		
		ДлинаСтроки = 50;
		КоличествоСтрок = 5;
		
		ЗаголовокДела = СтрЗаменить(Выборка.ЗаголовокДела, Символы.ПС, " ");
		Для Инд = 1 По КоличествоСтрок Цикл
			
			Если СтрДлина(ЗаголовокДела) > ДлинаСтроки Тогда
				врЗаголовокДела = СокрЛП(Лев(ЗаголовокДела, ДлинаСтроки));
				
				ПозицияПробела = 0;
				Для Поз = 1 По ДлинаСтроки Цикл
					Если Сред(врЗаголовокДела, ДлинаСтроки - Поз + 1, 1) = " " Тогда 
						ПозицияПробела = ДлинаСтроки - Поз + 1;
						Прервать;
					КонецЕсли;	
				КонецЦикла;
				
				Если ПозицияПробела > 0 Тогда 
					врЗаголовокДела = Лев(врЗаголовокДела, ПозицияПробела);
					Выполнить("ЗаголовокДела" + Инд + " = врЗаголовокДела");
					ЗаголовокДела = Сред(ЗаголовокДела, ПозицияПробела + 1)
				Иначе
					Выполнить("ЗаголовокДела" + Инд + " = врЗаголовокДела");
					ЗаголовокДела = Сред(ЗаголовокДела, ДлинаСтроки + 1)
				КонецЕсли;	
				
			Иначе	
				Выполнить("ЗаголовокДела" + Инд + " = ЗаголовокДела");
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;	
		
		ОбластьОбложка.Параметры.Заполнить(Выборка);
		ОбластьОбложка.Параметры.ЗаголовокДела1 = ЗаголовокДела1;
		ОбластьОбложка.Параметры.ЗаголовокДела2 = ЗаголовокДела2;
		ОбластьОбложка.Параметры.ЗаголовокДела3 = ЗаголовокДела3;
		ОбластьОбложка.Параметры.ЗаголовокДела4 = ЗаголовокДела4;
		ОбластьОбложка.Параметры.ЗаголовокДела5 = ЗаголовокДела5;
		
		Если ЗначениеЗаполнено(Выборка.ДатаОкончания) Тогда 
			ОбластьОбложка.Параметры.ПериодДела = ПредставлениеПериода(Выборка.ДатаНачала, КонецДня(Выборка.ДатаОкончания));
		Иначе
			ОбластьОбложка.Параметры.ПериодДела = Формат(Выборка.ДатаНачала, "ДФ='dd MMMM yyyy'") + " - ";
		КонецЕсли;	
		
		ОбластьОбложка.Параметры.КоличествоЛистов = Выборка.КоличествоЛистов;
		
		ОбластьОбложка.Параметры.НаименованиеПредприятия = РаботаСОрганизациями.ПолучитьНаименованиеОрганизации(Выборка.Организация);
		Если ЗначениеЗаполнено(Выборка.Подразделение) Тогда
			ОбластьОбложка.Параметры.НаименованиеПодразделения = Выборка.Подразделение;
		КонецЕсли;
		
		СрокХранения = Выборка.СрокХранения;
		Если ТипЗнч(СрокХранения) = Тип("Число") Тогда 
			ОбластьОбложка.Параметры.СрокХранения = Строка(СрокХранения) + " " + ДелопроизводствоКлиентСервер.ПодписьЛет(СрокХранения);
		Иначе
			ОбластьОбложка.Параметры.СрокХранения = СрокХранения;
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьОбложка);
	КонецЦикла;	
	
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьВнутреннейОписи(МассивОбъектов, ОбъектыПечати) Экспорт 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ВнутренняяОпись";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ДелаХраненияДокументов.ПФ_MXL_ВнутренняяОпись");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыВДелеТоме.Ссылка.РегистрационныйНомер КАК ИндексДокумента,
	|	ДокументыВДелеТоме.Ссылка.ДатаРегистрации КАК ДатаДокумента,
	|	ДокументыВДелеТоме.Ссылка.Наименование КАК ЗаголовокДокумента
	|ИЗ
	|	КритерийОтбора.ДокументыВДелеТоме(&Значение) КАК ДокументыВДелеТоме
	|ГДЕ
	|	НЕ ДокументыВДелеТоме.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента";
	
	ПервыйДокумент = Истина;
	Для Каждого Ссылка из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		Запрос.УстановитьПараметр("Значение", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапка 	 = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока 	 = Макет.ПолучитьОбласть("Строка");
		ОбластьПодвал 	 = Макет.ПолучитьОбласть("Подвал");
		ТабДок.Очистить();
		
		// заголовок
		ОбластьЗаголовок.Параметры.ИндексДела = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Ссылка.НоменклатураДел, "Индекс");
		ТабДок.Вывести(ОбластьЗаголовок);
		
		// шапка
		ТабДок.Вывести(ОбластьШапка);
		
		// строки
		Номер = 0;
		Пока Выборка.Следующий() Цикл
			Номер = Номер + 1;
			
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			ОбластьСтрока.Параметры.Номер = Номер;
			ТабДок.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ОбластьПодвал.Параметры.КоличествоДокументов = ?(Номер = 0, "", Строка(Номер) + ", " + ЧислоПрописью(Номер, , ",,,,,,,,0"));
		ОбластьПодвал.Параметры.Дата = ТекущаяДата();
		ОбластьПодвал.Параметры.Расшифровка = Строка(ПользователиКлиентСервер.ТекущийПользователь());
		ОбластьПодвал.Параметры.Должность = РаботаСПользователями.ПолучитьДолжность(
			ПользователиКлиентСервер.ТекущийПользователь());
		ТабДок.Вывести(ОбластьПодвал);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
	
Функция ПечатьЛистаЗаверителя(МассивОбъектов, ОбъектыПечати) Экспорт	
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ЛистЗаверитель";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ДелаХраненияДокументов.ПФ_MXL_ЛистЗаверитель");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Дела.НоменклатураДел.Индекс КАК НомерДела,
	|	Дела.КоличествоЛистов КАК КоличествоЛистов
	|ИЗ
	|	Справочник.ДелаХраненияДокументов КАК Дела
	|ГДЕ
	|	Дела.Ссылка В(&Ссылки)";
	
	Запрос.УстановитьПараметр("Ссылки", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЛистЗаверитель = Макет.ПолучитьОбласть("ЛистЗаверитель");
	ТабДок.Очистить();

	ПервыйДокумент = Истина;
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ОбластьЛистЗаверитель.Параметры.Заполнить(Выборка);
		ОбластьЛистЗаверитель.Параметры.КоличествоЛистов = ?(Выборка.КоличествоЛистов = 0, "", Строка(Выборка.КоличествоЛистов) + ", " + ЧислоПрописью(Выборка.КоличествоЛистов, , ",,,,,,,,0"));
		
		ОбластьЛистЗаверитель.Параметры.Дата = ТекущаяДата();
		ОбластьЛистЗаверитель.Параметры.Расшифровка = Строка(ПользователиКлиентСервер.ТекущийПользователь());
		ОбластьЛистЗаверитель.Параметры.Должность = РаботаСПользователями.ПолучитьДолжность(
			ПользователиКлиентСервер.ТекущийПользователь());
		
		ТабДок.Вывести(ОбластьЛистЗаверитель);
	КонецЦикла;	
	
	Возврат ТабДок;
	
КонецФункции
	
Функция ПечатьКартыЗаместителя(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_КартаЗаместитель";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ДелаХраненияДокументов.ПФ_MXL_КартаЗаместитель");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Дела.НомерТома КАК НомерТома,
	|	Дела.НоменклатураДел.Индекс КАК НомерДела,
	|	Дела.НоменклатураДел.Наименование КАК ЗаголовокДела,
	|	Дела.Организация КАК Организация
	|ИЗ
	|	Справочник.ДелаХраненияДокументов КАК Дела
	
	|ГДЕ
	|	Дела.Ссылка В(&Ссылки)";
	
	Запрос.УстановитьПараметр("Ссылки", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьКартаЗаместитель = Макет.ПолучитьОбласть("КартаЗаместитель");
	ТабДок.Очистить();
	
	ПервыйДокумент = Истина;
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ОбластьКартаЗаместитель.Параметры.Заполнить(Выборка);
		
		ОбластьКартаЗаместитель.Параметры.НаименованиеПредприятия = РаботаСОрганизациями.ПолучитьНаименованиеОрганизации(Выборка.Организация);
		
		ТабДок.Вывести(ОбластьКартаЗаместитель);
	КонецЦикла;	
	
	Возврат ТабДок;
	
КонецФункции

// Формирует печатную форму реестра электронных документов.
//
// Параметры:
//   МассивОбъектов - Массив - Массив ссылок на объекты которые нужно распечатать.
//   ОбъектыПечати - СписокЗначений - список объектов печати.
//
// Возвращаемое значение:
//  ТабличныйДокумент - ТабличныйДокумент - печатная форма.
//
Функция ПечатьРеестраЭД(МассивОбъектов, ОбъектыПечати, ПараметрыПечати = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_РеестрЭД";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ДелаХраненияДокументов.ПФ_MXL_РеестрЭД");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Дела.Ссылка КАК Дело,
	|	ПередачаДелВАрхивДелаХраненияДокументов.Ссылка.Номер КАК НомерОписи,
	|	ПередачаДелВАрхивДелаХраненияДокументов.НомерСтроки КАК НомерДелаПоОписи,
	|	Номенклатура.КатегорияДела КАК КатегорияДела,
	|	Номенклатура.ПоЛичномуСоставу КАК ПоЛичномуСоставу
	|ИЗ
	|	Справочник.ДелаХраненияДокументов КАК Дела
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаДелВАрхив.ДелаХраненияДокументов КАК ПередачаДелВАрхивДелаХраненияДокументов
	|		ПО (ПередачаДелВАрхивДелаХраненияДокументов.ДелоХраненияДокументов = Дела.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураДел КАК Номенклатура
	|		ПО Дела.НоменклатураДел = Номенклатура.Ссылка
	|ГДЕ
	|	Дела.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ДелаОписей = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Файлы.ТекущаяВерсияРазмер), 0) КАК ТекущаяВерсияРазмер,
		|	ВнутренниеДокументы.Ссылка,
		|	НАЧАЛОПЕРИОДА(ВнутренниеДокументы.ДатаРегистрации, ДЕНЬ) КАК ДатаДокумента,
		|	ВнутренниеДокументы.РегистрационныйНомер КАК НомерДокумента,
		|	ВнутренниеДокументы.Наименование КАК НаименованиеДокумента
		|ИЗ
		|	КритерийОтбора.ДокументыВДелеТоме(&Значение) КАК ДокументыВДелеТоме
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО Файлы.ВладелецФайла = ДокументыВДелеТоме.Ссылка
		|		И Файлы.ПометкаУдаления = ЛОЖЬ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
		|		ПО ДокументыВДелеТоме.Ссылка = ВнутренниеДокументы.Ссылка
		|ГДЕ
		|	НЕ ДокументыВДелеТоме.Ссылка.ПометкаУдаления
		|СГРУППИРОВАТЬ ПО
		|	ВнутренниеДокументы.Ссылка,
		|	ВнутренниеДокументы.РегистрационныйНомер,
		|	ВнутренниеДокументы.Наименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Файлы.ТекущаяВерсияРазмер), 0) КАК ТекущаяВерсияРазмер,
		|	ВходящиеДокументы.Ссылка,
		|	НАЧАЛОПЕРИОДА(ВходящиеДокументы.ДатаРегистрации, ДЕНЬ),
		|	ВходящиеДокументы.РегистрационныйНомер,
		|	ВходящиеДокументы.Наименование
		|ИЗ
		|	КритерийОтбора.ДокументыВДелеТоме(&Значение) КАК ДокументыВДелеТоме
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО Файлы.ВладелецФайла = ДокументыВДелеТоме.Ссылка
		|		И Файлы.ПометкаУдаления = ЛОЖЬ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВходящиеДокументы КАК ВходящиеДокументы
		|		ПО ДокументыВДелеТоме.Ссылка = ВходящиеДокументы.Ссылка
		|ГДЕ
		|	НЕ ДокументыВДелеТоме.Ссылка.ПометкаУдаления
		|СГРУППИРОВАТЬ ПО
		|	ВходящиеДокументы.Ссылка,
		|	ВходящиеДокументы.РегистрационныйНомер,
		|	ВходящиеДокументы.Наименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Файлы.ТекущаяВерсияРазмер), 0) КАК ТекущаяВерсияРазмер,
		|	ИсходящиеДокументы.Ссылка,
		|	НАЧАЛОПЕРИОДА(ИсходящиеДокументы.ДатаРегистрации, ДЕНЬ),
		|	ИсходящиеДокументы.РегистрационныйНомер,
		|	ИсходящиеДокументы.Наименование
		|ИЗ
		|	КритерийОтбора.ДокументыВДелеТоме(&Значение) КАК ДокументыВДелеТоме
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО Файлы.ВладелецФайла = ДокументыВДелеТоме.Ссылка
		|		И Файлы.ПометкаУдаления = ЛОЖЬ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсходящиеДокументы КАК ИсходящиеДокументы
		|		ПО ДокументыВДелеТоме.Ссылка = ИсходящиеДокументы.Ссылка
		|ГДЕ
		|	НЕ ДокументыВДелеТоме.Ссылка.ПометкаУдаления
		|СГРУППИРОВАТЬ ПО
		|	ИсходящиеДокументы.Ссылка,
		|	ИсходящиеДокументы.РегистрационныйНомер,
		|	ИсходящиеДокументы.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаДокумента,
		|	НомерДокумента";
	
	ПервыйОбъект = Истина;
	Для Каждого Ссылка из МассивОбъектов Цикл
		
		Если Не ПервыйОбъект Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйОбъект = Ложь;
		
		Запрос.УстановитьПараметр("Значение", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапка 	 = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока 	 = Макет.ПолучитьОбласть("Строка");
		ОбластьПодвал 	 = Макет.ПолучитьОбласть("Подвал");
		ТабДок.Очистить();
		
		// Заголовок
		СтрокаДелОписей = ДелаОписей.Найти(Ссылка, "Дело");
		Если СтрокаДелОписей <> Неопределено Тогда
			ОбластьЗаголовок.Параметры.НомерОписи = СтрокаДелОписей.НомерОписи;
			ОбластьЗаголовок.Параметры.НомерДелаПоОписи = СтрокаДелОписей.НомерДелаПоОписи;
			ВидОписи = "";
			Если СтрокаДелОписей.ПоЛичномуСоставу = Истина Тогда
				ВидОписи = НСтр("ru = 'По личному составу'");
			ИначеЕсли СтрокаДелОписей.КатегорияДела = Перечисления.КатегорииДел.ВременноеДо10 Тогда
				ВидОписи = НСтр("ru = 'Временного (до 10 лет) срока хранения'");
			ИначеЕсли СтрокаДелОписей.КатегорияДела = Перечисления.КатегорииДел.ВременноеСвыше10 Тогда
				ВидОписи = НСтр("ru = 'Временного (свыше 10 лет) срока хранения'");
			ИначеЕсли СтрокаДелОписей.КатегорияДела = Перечисления.КатегорииДел.Постоянное Тогда
				ВидОписи = НСтр("ru = 'Постоянного хранения'");
			КонецЕсли;
			ОбластьЗаголовок.Параметры.ВидОписи = ВидОписи;
		КонецЕсли;
		
		Если ПараметрыПечати <> Неопределено И ПараметрыПечати.Свойство("Год") Тогда
			ОбластьЗаголовок.Параметры.ОтчетныйГод = Формат(ПараметрыПечати.Год, "ЧГ=0");
		Иначе
			ОбластьЗаголовок.Параметры.ОтчетныйГод = "____";
		КонецЕсли;
		
		РеквизитыДела = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Ссылка, "НоменклатураДел.Индекс, ПолноеНаименование");
		ОбластьЗаголовок.Параметры.ИндексДела = РеквизитыДела.НоменклатураДелИндекс;
		ОбластьЗаголовок.Параметры.ЗаголовокДела = РеквизитыДела.ПолноеНаименование;
		ТабДок.Вывести(ОбластьЗаголовок);
		
		// Шапка
		ТабДок.Вывести(ОбластьШапка);
		
		// Строки
		Номер = 0;
		Пока Выборка.Следующий() Цикл
			Номер = Номер + 1;
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			ОбластьСтрока.Параметры.РазмерФайлов = Формат(
				Выборка.ТекущаяВерсияРазмер / 1024 / 1024, "ЧДЦ=3");;
			ТабДок.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		// Подвал
		Сотрудник = ПользователиКлиентСервер.ТекущийПользователь();
		ОбластьПодвал.Параметры.Расшифровка = Строка(Сотрудник);
		ОбластьПодвал.Параметры.Должность = РаботаСПользователями.ПолучитьДолжность(
			ПользователиКлиентСервер.ТекущийПользователь());
		ТабДок.Вывести(ОбластьПодвал);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
КонецПроцедуры

// В зависимости от формы документов Номенклатуры дел, формирует:
// - реестр электронных документов для электронных форм документов,
// - внутреннюю опись для бумажных форм документов.
//
// Параметры:
//   ДелоХраненияДокументов - СправочникСсылка.ДелаХраненияДокументов - ссылка на Дело (Том) Номенклатуры дел.
//
// Возвращаемое значение:
//  Строка - адрес во временном хранилище.
//
Функция РеестрДокументов(ДелоХраненияДокументов) Экспорт
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(ДелоХраненияДокументов) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ФормаДокументов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ДелоХраненияДокументов, "НоменклатураДел.ФормаДокументов");
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВременнаяПапка = ПолучитьИмяВременногоФайла() + ПолучитьРазделительПути();
	СоздатьКаталог(ВременнаяПапка);
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДелоХраненияДокументов);
	
	ОбъектыПечати = Новый СписокЗначений;
	
	Если ФормаДокументов = Перечисления.ВариантыФормДокументов.Электронная Тогда
		ТабличныйДокумент = ПечатьРеестраЭД(МассивОбъектов, ОбъектыПечати);
	Иначе
		ТабличныйДокумент = ПечатьВнутреннейОписи(МассивОбъектов, ОбъектыПечати);
	КонецЕсли;
	
	Попытка
		ИмяФайлаПечатнойФормы = ВременнаяПапка + "human.mxl";
		ТабличныйДокумент.Записать(ИмяФайлаПечатнойФормы);
	Исключение
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрацииРеестраЭД(),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		УдалитьВременныеФайлы(ВременнаяПапка);
		Возврат Результат;
	КонецПопытки;
	
	ПространствоИменСхемы = ОбменСАрхивом.ВерсияФорматаДляОтправкиСообщений();
	
	ИмяМашиночитаемогоФайла = ВременнаяПапка + "machine.xml";
	ЭлементXDTOРеестрЭД = 
		ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИменСхемы, "CaseVolumeDocumentsList"));
	
	ЭлементXDTOРеестрЭД.DossierID = Строка(ДелоХраненияДокументов.УникальныйИдентификатор());
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Файлы.ТекущаяВерсияРазмер), 0) КАК ТекущаяВерсияРазмер,
		|	ВнутренниеДокументы.Ссылка,
		|	НАЧАЛОПЕРИОДА(ВнутренниеДокументы.ДатаРегистрации, ДЕНЬ) КАК ДатаДокумента,
		|	ВнутренниеДокументы.РегистрационныйНомер КАК НомерДокумента,
		|	ВнутренниеДокументы.Наименование КАК НаименованиеДокумента
		|ИЗ
		|	КритерийОтбора.ДокументыВДелеТоме(&Значение) КАК ДокументыВДелеТоме
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО Файлы.ВладелецФайла = ДокументыВДелеТоме.Ссылка
		|		И Файлы.ПометкаУдаления = ЛОЖЬ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
		|		ПО ДокументыВДелеТоме.Ссылка = ВнутренниеДокументы.Ссылка
		|ГДЕ
		|	НЕ ДокументыВДелеТоме.Ссылка.ПометкаУдаления
		|СГРУППИРОВАТЬ ПО
		|	ВнутренниеДокументы.Ссылка,
		|	ВнутренниеДокументы.РегистрационныйНомер,
		|	ВнутренниеДокументы.Наименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Файлы.ТекущаяВерсияРазмер), 0) КАК ТекущаяВерсияРазмер,
		|	ВходящиеДокументы.Ссылка,
		|	НАЧАЛОПЕРИОДА(ВходящиеДокументы.ДатаРегистрации, ДЕНЬ),
		|	ВходящиеДокументы.РегистрационныйНомер,
		|	ВходящиеДокументы.Наименование
		|ИЗ
		|	КритерийОтбора.ДокументыВДелеТоме(&Значение) КАК ДокументыВДелеТоме
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО Файлы.ВладелецФайла = ДокументыВДелеТоме.Ссылка
		|		И Файлы.ПометкаУдаления = ЛОЖЬ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВходящиеДокументы КАК ВходящиеДокументы
		|		ПО ДокументыВДелеТоме.Ссылка = ВходящиеДокументы.Ссылка
		|ГДЕ
		|	НЕ ДокументыВДелеТоме.Ссылка.ПометкаУдаления
		|СГРУППИРОВАТЬ ПО
		|	ВходящиеДокументы.Ссылка,
		|	ВходящиеДокументы.РегистрационныйНомер,
		|	ВходящиеДокументы.Наименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Файлы.ТекущаяВерсияРазмер), 0) КАК ТекущаяВерсияРазмер,
		|	ИсходящиеДокументы.Ссылка,
		|	НАЧАЛОПЕРИОДА(ИсходящиеДокументы.ДатаРегистрации, ДЕНЬ),
		|	ИсходящиеДокументы.РегистрационныйНомер,
		|	ИсходящиеДокументы.Наименование
		|ИЗ
		|	КритерийОтбора.ДокументыВДелеТоме(&Значение) КАК ДокументыВДелеТоме
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО Файлы.ВладелецФайла = ДокументыВДелеТоме.Ссылка
		|		И Файлы.ПометкаУдаления = ЛОЖЬ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсходящиеДокументы КАК ИсходящиеДокументы
		|		ПО ДокументыВДелеТоме.Ссылка = ИсходящиеДокументы.Ссылка
		|ГДЕ
		|	НЕ ДокументыВДелеТоме.Ссылка.ПометкаУдаления
		|СГРУППИРОВАТЬ ПО
		|	ИсходящиеДокументы.Ссылка,
		|	ИсходящиеДокументы.РегистрационныйНомер,
		|	ИсходящиеДокументы.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаДокумента,
		|	НомерДокумента";
	Запрос.УстановитьПараметр("Значение", ДелоХраненияДокументов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Номер = 0;
	
	Пока Выборка.Следующий() Цикл
		Номер = Номер + 1;
		
		ЭлементXDTOДокументыВТоме =
			ФабрикаXDTO.Создать(ЭлементXDTOРеестрЭД.Свойства().Получить("Documents").Тип);
		ЭлементXDTOДокументыВТоме.InventoryNumber = Номер;
		ЭлементXDTOДокументыВТоме.ID = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		ЭлементXDTOДокументыВТоме.Date = Выборка.ДатаДокумента;
		ЭлементXDTOДокументыВТоме.Number = Выборка.НомерДокумента;
		ЭлементXDTOДокументыВТоме.Header = Выборка.НаименованиеДокумента;
		
		РазмерВМб = Окр(Выборка.ТекущаяВерсияРазмер / (1024 * 1024), 3);
		ЭлементXDTOДокументыВТоме.SizeMb = РазмерВМб;
		
		ЭлементXDTOРеестрЭД.Documents.Добавить(ЭлементXDTOДокументыВТоме);
	КонецЦикла;
	
	ПотокЗаписи = Новый ЗаписьXML();
	ПотокЗаписи.ОткрытьФайл(ИмяМашиночитаемогоФайла);
	ПотокЗаписи.ЗаписатьОбъявлениеXML();
	
	Попытка
		ФабрикаXDTO.ЗаписатьXML(ПотокЗаписи, ЭлементXDTOРеестрЭД);
		ПотокЗаписи.Закрыть();
	Исключение
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрацииРеестраЭД(),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		УдалитьВременныеФайлы(ВременнаяПапка);
		ВызватьИсключение;
	КонецПопытки;
	
	ИмяZipФайлаРеестраЭД = ВременнаяПапка + "РеестрЭД.zip";
	ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяZipФайлаРеестраЭД);
	ЗаписьZipФайла.Добавить(ИмяФайлаПечатнойФормы);
	ЗаписьZipФайла.Добавить(ИмяМашиночитаемогоФайла);
	
	Попытка
		ЗаписьZipФайла.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрацииРеестраЭД(),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		УдалитьВременныеФайлы(ВременнаяПапка);
		ВызватьИсключение;
	КонецПопытки;
	
	ДанныеФайлаРеестраЭД = Новый ДвоичныеДанные(ИмяZipФайлаРеестраЭД);
	Результат = ПоместитьВоВременноеХранилище(ДанныеФайлаРеестраЭД);
	УдалитьВременныеФайлы(ВременнаяПапка);
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьВременныеФайлы(ВременнаяПапка)
	
	Попытка
		УдалитьФайлы(ВременнаяПапка);
	Исключение
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрацииРеестраЭД(),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры 

Функция СобытиеЖурналаРегистрацииРеестраЭД()
	
	Возврат НСтр("ru = 'Ошибка формирования реестра ЭД'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

#КонецЕсли
